app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Michelle"], ["created_at", "2020-09-14 17:35:19.169992"], ["updated_at", "2020-09-14 17:35:19.169992"], ["artist_id", 4]]